Catalogs/фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_ВидыДокументов</xr:Item>
				<xr:Item>Catalog.фин_КлассификаторРегистров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыОтраженийПервичныхДокументовВБюджетировании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПолученияСоответствийДляПервичныхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВариантыПолученияСоответствийДляПервичныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантДляТрансформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ВариантыПолученияСоответствийДляПервичныхДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательВарианта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитЗаполненияПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справочник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трансформация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Числовой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыВходящихПоказателейБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ТипыВходящихПоказателейБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ТипыВходящихПоказателейБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Числовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ВидыОтраженийПервичныхДокументовВБюджетировании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыОтраженийПервичныхДокументовВБюджетировании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоШапкеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДвижениямВРегистрах</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_ВариантыПолученияСоответствийДляПервичныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ВариантыПолученияСоответствийДляПервичныхДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВариантыРасчетаСоответствийДляПервичныхДанныхБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеРегистраРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИначе</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторСоответствийПервичныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Числовой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справочник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СправочникПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ТипыВходящихПоказателейБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачальноеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Соответствия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоединениеСРегистром</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзмерениеРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/фин_НастройкиПолученияСоответствийДляПервичныхДанныхБюджетирования/Forms/ФормаНастройкиСвязи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры,"ОбъектИБ,ВидДанных,ИмяИсточника,Вариант,ВариантДляТрансформации,Значение,ПоказательВарианта,РеквизитЗаполненияПоказателя,Трансформация,ФиксированноеЗначение");
	Режим = ?(ФиксированноеЗначение,1,0);
	Элементы.Значение.ТолькоПросмотр = НЕ ФиксированноеЗначение;
	Элементы.РеквизитЗаполненияПоказателя.ТолькоПросмотр = ФиксированноеЗначение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.Числовой,
		|	Показатели.Справочник,
		|	Показатели.ТипПоказателя
		|ИЗ
		|	Справочник.фин_ВариантыПолученияСоответствийДляПервичныхДанных.ВходящиеПоказатели КАК Показатели
		|ГДЕ
		|	Показатели.Ссылка = &Ссылка
		|	И Показатели.Показатель = &Показатель";
	
	Запрос.УстановитьПараметр("Показатель", ПоказательВарианта);
	Запрос.УстановитьПараметр("Ссылка", Вариант);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекущиеДанные = РезультатЗапроса.Выбрать();
	
	Если ТекущиеДанные.Следующий() Тогда
		 Если ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.Справочник") Тогда
		 	ИмяТипа = "СправочникСсылка."+ТекущиеДанные.Справочник;
		 ИначеЕсли ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовРасчета") Тогда
		 	ИмяТипа = "ПланВидовРасчетаСсылка."+ТекущиеДанные.Справочник;
		 ИначеЕсли ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовХарактеристик") Тогда
		 	ИмяТипа = "ПланВидовХарактеристикСсылка."+ТекущиеДанные.Справочник;
		 ИначеЕсли ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.ПланСчетов") Тогда
		 	ИмяТипа = "ПланСчетовСсылка."+ТекущиеДанные.Справочник;
		 ИначеЕсли ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.Перечисление") Тогда
		 	ИмяТипа = "ПеречислениеСсылка."+ТекущиеДанные.Справочник;
		 ИначеЕсли ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.Числовой") Тогда
		 	ИмяТипа = "Число";
		 ИначеЕсли ТекущиеДанные.ТипПоказателя = ПредопределенноеЗначение("Перечисление.фин_ТипыВходящихПоказателейБюджетирования.Дата") Тогда
		 	ИмяТипа = "Дата";
		 Иначе
		 	ИмяТипа = "Булево";
		КонецЕсли;
		мТипЗначения = ТекущиеДанные.ТипПоказателя;
		ОписаниеТипа = новый ОписаниеТипов(ИмяТипа);
		Элементы.Значение.ОграничениеТипа = ОписаниеТипа;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	ФиксированноеЗначение = Режим = 1;
	Если режим = 0 Тогда
		Значение = ОписаниеТипа.ПривестиЗначение(Неопределено);
	Иначе
		РеквизитЗаполненияПоказателя = "";
	КонецЕсли;
	Элементы.Значение.ТолькоПросмотр = НЕ ФиксированноеЗначение;
	Элементы.РеквизитЗаполненияПоказателя.ТолькоПросмотр = ФиксированноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитЗаполненияПоказателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(ОбъектИБ) Тогда
		ПоказатьПредупреждение(,"Не указан вид документов/регистров!");
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ОбъектИБ)=Тип("СправочникСсылка.фин_ВидыДокументов") И ВидДанных <>ПредопределенноеЗначение("Перечисление.фин_ВидыОтраженийПервичныхДокументовВБюджетировании.ПоШапкеДокумента") И ИмяИсточника = "" Тогда
		ПоказатьПредупреждение(,"Не указан источник данных!");
		Возврат;
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	ЗаполнениеПоказателейРеквизитЗаполненияПоказателяНачалоВыбораНаСервере(СтруктураПараметров);
	ОткрытьФорму("Справочник.усд_УсловияВыполненияОперацийПоДокументам.Форма.ФормаВыбораРеквизита",СтруктураПараметров,Элемент,УникальныйИдентификатор,?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,Окно));
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПоказателейРеквизитЗаполненияПоказателяНачалоВыбораНаСервере(СтруктураПараметров)
	ВсеПоля 		= Ложь;
	
	Если НЕ Вариант.Предопределенный Тогда
		Если ОписаниеТипа.Типы().Количество()>0 Тогда
			ТребуемыйТип = ОписаниеТипа.Типы()[0];
		Иначе
			ТребуемыйТип = Неопределено;
		КонецЕсли;
		ТипЗначения = мТипЗначения;
		ИмяДокумента 	= ОбъектИБ.ПрограммныйИдентификатор;
		Документ 		= типЗнч(ОбъектИБ)=Тип("СправочникСсылка.фин_ВидыДокументов");
		Список 			= Новый СписокЗначений;
		ТипПриТрансформации = "";
		Если ВариантДляТрансформации.Пустая() Тогда
			Трансформация = Ложь;
		ИначеЕсли Трансформация Тогда 
			Если ВариантДляТрансформации.ВходящиеПоказатели.Количество() >0 Тогда
				ИсточникПриТрансформации 	= ВариантДляТрансформации.ВходящиеПоказатели[0].Справочник;
				мТипЗначения 				= ВариантДляТрансформации.ВходящиеПоказатели[0].ТипПоказателя;
				Если мТипЗначения =Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Числовой Тогда
					ТребуемыйТип = Тип("Число");
				ИначеЕсли мТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Булево Тогда
					ТребуемыйТип = Тип("Булево");
				ИначеЕсли мТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Дата Тогда
					ТребуемыйТип = Тип("Дата");
				ИначеЕсли мТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Перечисление Тогда
					ТребуемыйТип = Тип("ПеречислениеСсылка."+ИсточникПриТрансформации);
				ИначеЕсли мТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовРасчета Тогда
					ТребуемыйТип = Тип("ПланВидовРасчетаСсылка."+ИсточникПриТрансформации);
				ИначеЕсли мТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовХарактеристик Тогда
					ТребуемыйТип = Тип("ПланВидовХарактеристикСсылка."+ИсточникПриТрансформации);
				ИначеЕсли мТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланСчетов Тогда
					ТребуемыйТип = Тип("ПланСчетовСсылка."+ИсточникПриТрансформации);
				Иначе
					ТребуемыйТип = Тип("СправочникСсылка."+ИсточникПриТрансформации);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Вариант = Справочники.фин_ВариантыПолученияСоответствийДляПервичныхДанных.ПолучениеПодразделенияПоПодразделениюОрганизации Тогда
		ТипЗначения = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Справочник;
		Если ПоказательВарианта = "ПодразделениеОрганизации" Тогда
			Справочник = "ПодразделенияОрганизаций";
			ТребуемыйТип = Тип("СправочникСсылка."+Справочник);
		Иначе
			Справочник = "Организации";
			ТребуемыйТип = Тип("СправочникСсылка."+Справочник);
		КонецЕсли;
	ИначеЕсли Вариант = Справочники.фин_ВариантыПолученияСоответствийДляПервичныхДанных.ПоНастройкеСоответствийДляИзмеренийБюджетирования Тогда
		ВсеПоля = Истина;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ОбъектИБ)=Тип("СправочникСсылка.фин_ВидыДокументов") Тогда
		СтруктураПараметров = Новый Структура("ВидДокументов,ВидДанных,ИмяИсточника",ОбъектИБ,ВидДанных,ИмяИсточника);
	Иначе
		СтруктураПараметров = Новый Структура("ВидДокументов,ВидДанных,ИмяИсточника",ОбъектИБ,Перечисления.фин_ВидыОтраженийПервичныхДокументовВБюджетировании.ПоДвижениямВРегистрах,ОбъектИБ.ПолучитьОбъект().ПолноеИмя());
	КонецЕсли;
	СтруктураПараметров.Вставить("ТребуетсяАвтовыборПоСубконто",	(ТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Справочник ИЛИ ТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Перечисление ИЛИ ТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовРасчета ИЛИ ТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовХарактеристик ИЛИ ТипЗначения=Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланСчетов));
	СтруктураПараметров.Вставить("ТребуемыйТип",					ТребуемыйТип);
	СтруктураПараметров.Вставить("БезРеквизитовШапки",				?(ТипЗнч(ОбъектИБ)=Тип("СправочникСсылка.фин_КлассификаторРегистров"),Истина,Ложь));
	СтруктураПараметров.Вставить("ВсеПоля",							ВсеПоля);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("ВариантДляТрансформации,Значение,ПоказательВарианта,РеквизитЗаполненияПоказателя,Трансформация,ФиксированноеЗначение",ВариантДляТрансформации,Значение,ПоказательВарианта,РеквизитЗаполненияПоказателя,Трансформация,ФиксированноеЗначение));
КонецПроцедуры

&НаКлиенте
Процедура РеквизитЗаполненияПоказателяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РеквизитЗаполненияПоказателя = ВыбранноеЗначение.Путь;
КонецПроцедуры
